In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
#数据分析/数据挖掘
#有数据的情况下：
#数据预处理
#数据清洗（空数据，异常值）
#数据集成（多个数据合并到一起，级联）数据可能存放多个表中
#数据转化
#数据规约（属性减少（删除不重要属性），数据减少去重操作）

In [3]:
#numpy数组的集成
nd1 = np.random.randint(0,150,(5,10))
nd2 = np.random.randint(0,150,(6,10))
display(nd1,nd2)

array([[118,  83,  73,   4,  32,  31, 141, 132,  78,  61],
       [140,  72,  17, 113,  89,  51,  11, 114, 133,  92],
       [ 87,  37,  42, 135,  14,  37,  23, 133, 104, 146],
       [131,  18,  86,  66,  84,  34,  77,  73,  60,  91],
       [ 51, 127, 104,  32,  76, 117,  34,   5,   2,  33]])

array([[  4, 124,  32,  89,  69,   9, 122, 114,  26,   1],
       [118,  82, 122,  89,  54,  20, 149,  84,  44, 125],
       [147, 145,   0,  51,  39,  18,  55, 123,  99, 133],
       [ 15, 117,  83, 113,  54,  57, 114, 111,  15, 133],
       [  0,   2,  51,  85, 133,   8,  93,  75,  38, 114],
       [  3, 121, 136,  38,  12,   2,  10,  45, 108,  65]])

In [4]:
nd3 = np.concatenate((nd1,nd2),axis=0)
nd3

array([[118,  83,  73,   4,  32,  31, 141, 132,  78,  61],
       [140,  72,  17, 113,  89,  51,  11, 114, 133,  92],
       [ 87,  37,  42, 135,  14,  37,  23, 133, 104, 146],
       [131,  18,  86,  66,  84,  34,  77,  73,  60,  91],
       [ 51, 127, 104,  32,  76, 117,  34,   5,   2,  33],
       [  4, 124,  32,  89,  69,   9, 122, 114,  26,   1],
       [118,  82, 122,  89,  54,  20, 149,  84,  44, 125],
       [147, 145,   0,  51,  39,  18,  55, 123,  99, 133],
       [ 15, 117,  83, 113,  54,  57, 114, 111,  15, 133],
       [  0,   2,  51,  85, 133,   8,  93,  75,  38, 114],
       [  3, 121, 136,  38,  12,   2,  10,  45, 108,  65]])

In [20]:
df1 = DataFrame(data=np.random.randint(0,150,(3,3)),index=list('ABC'),columns=['python','en','math'])
df2 = DataFrame(data=np.random.randint(0,150,(7,3)),index=list('DEFGHIJ'),columns=['python','en','math'])
display(df1,df2)

   python   en  math
A      34  113   109
B      98  124   139
C      21   20    46

   python   en  math
D      74  105   115
E      27   25    15
F       7   29   140
G      47  128    81
H      54   15    53
I      19  149    80
J      56   43    89

In [24]:
df3 = df1.append(df2)
df3

   python   en  math
A      34  113   109
B      98  124   139
C      21   20    46
D      74  105   115
E      27   25    15
F       7   29   140
G      47  128    81
H      54   15    53
I      19  149    80
J      56   43    89

In [38]:
pd.concat([df1,df2],axis=0)

   python   en  math
A      34  113   109
B      98  124   139
C      21   20    46
D      74  105   115
E      27   25    15
F       7   29   140
G      47  128    81
H      54   15    53
I      19  149    80
J      56   43    89

In [27]:
pd.concat([df1,df2],axis=1,ignore_index=True)

F:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      0      1      2     3      4      5
A  34.0  113.0  109.0   NaN    NaN    NaN
B  98.0  124.0  139.0   NaN    NaN    NaN
C  21.0   20.0   46.0   NaN    NaN    NaN
D   NaN    NaN    NaN  74.0  105.0  115.0
E   NaN    NaN    NaN  27.0   25.0   15.0
F   NaN    NaN    NaN   7.0   29.0  140.0
G   NaN    NaN    NaN  47.0  128.0   81.0
H   NaN    NaN    NaN  54.0   15.0   53.0
I   NaN    NaN    NaN  19.0  149.0   80.0
J   NaN    NaN    NaN  56.0   43.0   89.0

In [ ]:
# stack() 跟 unstack()的运用